import functions

mLines = functions.getLines()
functions.changeLines(mLines)

mNumbers = functions.getNumbersFromLines(mLines)

mainMatrix = functions.generateMatrix(mNumbers)

cutRowIndex = functions.getRowIndexOfMaxColumnElement(mainMatrix)
functions.removeRow(mainMatrix, cutRowIndex)

# Вариант 11
#
# Задан массив строк по типу:
# строка1: abccccd abfccdncccc
# строка2: abccd
#
# Задача1: организовать ввод
# Задача2: преобразовать в такой вид:
#       строка1: abc{4}d abfc{2}dnc{4}
#       строка2: abc{2}d
# Где в дужках количество элементов 'с', которые идут подряд
# Задача3: цифры, которые внутри скобок перенести в массив А
# Задача4: построить квадратную матрицу матрицу М, по размерам того массива; заполнить её так чтобы: главная диагональ, это элементы массива А, выше главной случайные число от 0 до первого элемента массива А, ниже главной случайные от 0 до последнего элемента массива А
# Задача5: в выбранном пользователем столбике найти макс элемент, если их несколько взять тот, у которого индекс больше
# Задача6: удалить рядок, в котором находился тот элементВариант 11
#
# Задан массив строк по типу:
# строка1: abccccd abfccdncccc
# строка2: abccd
#
# Задача1: организовать ввод
# Задача2: преобразовать в такой вид:
#       строка1: abc{4}d abfc{2}dnc{4}
#       строка2: abc{2}d
# Где в дужках количество элементов 'с', которые идут подряд
# Задача3: цифры, которые внутри скобок перенести в массив А
# Задача4: построить квадратную матрицу матрицу М, по размерам того массива; заполнить её так чтобы: главная диагональ, это элементы массива А, выше главной случайные число от 0 до первого элемента массива А, ниже главной случайные от 0 до последнего элемента массива А
# Задача5: в выбранном пользователем столбике найти макс элемент, если их несколько взять тот, у которого индекс больше
# Задача6: удалить рядок, в котором находился тот элемент
